app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("description", "isCompleted", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "asdfasdfasf"], ["isCompleted", 1], ["created_at", "2020-05-20 09:10:56.627297"], ["updated_at", "2020-05-20 09:10:56.627297"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "Eat shit"], ["updated_at", "2020-05-18 07:27:14.140474"], ["id", 2]]

  def destroy
    @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]

    def set_todo
      @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]